app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.admin_id = current_user.id

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "description", "price", "location", "start_date", "duration", "admin_id", "created_at", "updated_at") VALUES ('Event test', 'qzdqzdqzdqzd', 22, 'Paris', '2025-10-17 13:17:00', 30, 8, '2025-10-16 11:17:28.806206', '2025-10-16 11:17:28.806206') RETURNING "id"

  def set_event
    @event = Event.find(params.expect(:id))
---
SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1